Repository: dmvrtx/satchmo
Catalog: satchmo/apps/satchmo_utils/locale/*/LC_MESSAGES/django.po
Languages: ro

source: %(value)s is not a valid number
ro: %(value)s nu este un număr valid

source: Please enter a positive number
ro: Vă rugăm să introduceți un număr pozitiv

source: Please enter one and only one of those fields.
ro: Vă rugăm complectați doar unul dintre câmpuri.

source: These fields can not be the same.
ro: Aceste câmpuri nu pot avea aceeași valoare.

source: Card type does not match card number.
ro: Tipurile cardurilor nu corespund numerelor.

source: Invalid credit card number.
ro: Numărul cardului este invalid.

source: Thumbnail Settings
ro: Setări imagini mici

source: Thumbnail quality
ro: Calitate

source: Rename product images?
ro: Redenumiți imaginile produselor?

source: Automatically rename product images on upload?
ro: Redenumesc imaginile produselor automat?

source: Change:
ro: Schimbă:

source: Currently
ro: Acum

source: Change
ro: Schimbare
